Autodesk.Revit.DB.Structure.RebarBarType.SetCrankLength(Autodesk.Revit.DB.ElementId,System.Double)
Sets the crank length for the specified Rebar Crank Type.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
length:
The new value of the crank length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
-or-
For the specified Rebar Crank Type is auto calculated and the cannot be manually set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for length must be positive.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.GetCrankLength(Autodesk.Revit.DB.ElementId)
Gets the crank length taking into account the specified Rebar Crank Type.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
Returns:
Returns the crank length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.CanCrankParametersBeComputedUsingCrankAngledLength(Autodesk.Revit.DB.ElementId,System.Double)
Identifies if the all crank parameters can be computed for the specified crank angled length and Rebar Crank Type.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
crankAngledLength:
The value of the crank angled length to be tested.
Returns:
Returns true if the crank paramters can be computed using the input crank angled length, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.SetCrankAngledLength(Autodesk.Revit.DB.ElementId,System.Double)
Sets the crank angled length for the specified Rebar Crank Type.
Remarks:
When the crank angled length is set, the crank ratio is keeping the same value. The offset length and straight length are adjusted.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
crankAngledLength:
The new value of the crank angled length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
-or-
For the specified Rebar Crank Type is auto calculated and the cannot be manually set.
-or-
The crank parameters cannot be computed for the specified crankAngledLength and Rebar Crank Type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for crankAngledLength must be positive.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.GetCrankAngledLength(Autodesk.Revit.DB.ElementId)
Gets the crank angled length taking into account the specified Rebar Crank Type.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
Returns:
Returns the crank angled length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.CanCrankParametersBeComputedUsingCrankStraightLength(Autodesk.Revit.DB.ElementId,System.Double)
Identifies if the all crank parameters can be computed for the specified crank straight length and Rebar Crank Type.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
crankStraightLength:
The value of the crank straight length to be tested.
Returns:
Returns true if the crank paramters can be computed using the input crank straight length, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.SetCrankStraightLength(Autodesk.Revit.DB.ElementId,System.Double)
Sets the crank straigh length for the specified Rebar Crank Type.
Remarks:
When the crank straight length is set, the crank ratio is keeping the same value. The offset length and angled length are adjusted.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
crankStraightLength:
The new value of the crank straight length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
-or-
For the specified Rebar Crank Type is auto calculated and the cannot be manually set.
-or-
The crank parameters cannot be computed for the specified crankStraightLength and Rebar Crank Type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for crankStraightLength must be positive.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.GetCrankStraightLength(Autodesk.Revit.DB.ElementId)
Gets the crank straigth length taking into account the specified Rebar Crank Type.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
Returns:
Returns the crank straigth length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.CanCrankParametersBeComputedUsingCrankOffsetLength(Autodesk.Revit.DB.ElementId,System.Double)
Identifies if the all crank parameters can be computed for the specified crank offset length and Rebar Crank Type.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
crankOffsetLength:
The value of the crank offset length to be tested.
Returns:
Returns true if the crank paramters can be computed using the input crank offset length, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.SetCrankOffsetLength(Autodesk.Revit.DB.ElementId,System.Double)
Sets the crank offset length for the specified Rebar Crank Type.
Remarks:
When the crank offset length is set, the crank ratio is keeping the same value. The angled length and straight length are adjusted.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
crankOffsetLength:
The new value of the crank offset length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
-or-
For the specified Rebar Crank Type is auto calculated and the cannot be manually set.
-or-
The crank parameters cannot be computed for the specified crankOffsetLength and Rebar Crank Type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for crankOffsetLength must be positive.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.GetCrankOffsetLength(Autodesk.Revit.DB.ElementId)
Gets the crank offset taking into account the specified Rebar Crank Type.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
Returns:
Returns the crank offset length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.CanCrankParametersBeComputedUsingCrankRatio(Autodesk.Revit.DB.ElementId,System.Double)
Identifies if the all crank parameters can be computed for the specified crank ratio and Rebar Crank Type.
Remarks:
The crank slope is 1/crankRatio.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
crankRatio:
The value of the crank ratio to be tested.
Returns:
Returns true if the crank paramters can be computed using the input crank paramter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.SetCrankRatio(Autodesk.Revit.DB.ElementId,System.Double)
Sets the crank ratio for the specified Rebar Crank Type.
Remarks:
The crank slope is 1/crankRatio.
When the crank ratio is set, the crank offset length is keeping the same value. The angled length and straight length are adjusted.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
crankRatio:
The new value of the crank ratio.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
-or-
For the specified Rebar Crank Type is auto calculated and the cannot be manually set.
-or-
The crank parameters cannot be computed for the specified crankRatio and Rebar Crank Type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for crankRatio must be positive.
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.GetCrankRatio(Autodesk.Revit.DB.ElementId)
Gets the crank ratio taking into account the specified Rebar Crank Type.
Remarks:
The crank slope is 1/crankRatio.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
Returns:
Returns the crank ratio.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.SetAutoCalculatedCrank(Autodesk.Revit.DB.ElementId,System.Boolean)
Sets if the crank dimensions are auto calculated or not for the specified Rebar Crank Type.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
autoCalculated:
True, if the crank dimensions are auto calculated, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.GetAutoCalculatedCrank(Autodesk.Revit.DB.ElementId)
Identifies if the crank dimensions are auto calculated for the specified Rebar Crank Type.
rebarCrankTypeId:
The Rebar Crank Type id.
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
Returns:
Returns true if the crank dimensions are auto calculated for the specified Rebar Bar Type and Rebar Crank Type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarBarType.GetAutoCalculatedStaggerLength(Autodesk.Revit.DB.ElementId)
Identifies if the stagger length is auto calculated for the specified Rebar Splice Type.
Remarks:
If it is auto calculated, stagger length value is computed based on the formula: stagger length multiplier (found in splice type) * lap length.
rebarSpliceTypeId:
The Rebar Splice Type id.
Interactions with Rebar Splice Types can be done with the functions in Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.
Returns:
Returns true if the stagger length is auto calculated for the specified Rebar Bar Type and Rebar Splice Type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBarType.SetStaggerLength(Autodesk.Revit.DB.ElementId,System.Double)
Sets the stagger length for the specified Rebar Splice Type.
rebarSpliceTypeId:
The Rebar Splice Type id.
Interactions with Rebar Splice Types can be done with the functions in Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.
staggerLength:
The new value of the stagger length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
-or-
For the specified Rebar Splice Type the stagger length is auto calculated and the stagger length cannot be manually set.
Its value is computed based on the formula splice type: stagger length multiplier * bar nominal diameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for staggerLength must be non-negative.
Since:
2025

Autodesk.Revit.DB.Structure.RebarBarType.GetAutoCalculatedLapLength(Autodesk.Revit.DB.ElementId)
Identifies if the lap length is auto calculated for the specified Rebar Splice Type.
Remarks:
If it is auto calculated, lap length value is computed based on the formula: lap length multiplier (found in splice type) * bar nominal diameter.
rebarSpliceTypeId:
The Rebar Splice Type id.
Interactions with Rebar Splice Types can be done with the functions in Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.
Returns:
Returns true if the lap length is auto calculated for the specified Rebar Bar Type and Rebar Splice Type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBarType.SetLapLength(Autodesk.Revit.DB.ElementId,System.Double)
Sets the lap length for the specified Rebar Splice Type.
rebarSpliceTypeId:
The Rebar Splice Type id.
Interactions with Rebar Splice Types can be done with the functions in Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.
lapLength:
The new value of the lap length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
-or-
For the specified Rebar Splice Type the lap length is auto calculated and the lap length cannot be manually set.
Its value is computed based on the formula splice type: lap length multiplier * bar nominal diameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for lapLength must be non-negative.
Since:
2025

Autodesk.Revit.DB.Structure.RebarBarType.BarMassPerUnitLength
Defines bar mass per unit length of rebar.
The bar mass per unit length of rebar
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for barMassPerUnitLength must be non-negative.
Since:
2027